# PhyMaterialParamBendingReinforcement Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..PhyMaterialParamBendingReinforcement Property
ParameterTypeId Class See Also
---
"Bending reinforcement"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId PhyMaterialParamBendingReinforcement { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property PhyMaterialParamBendingReinforcement As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ PhyMaterialParamBendingReinforcement {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace